# официальный образ PostgreSQL
FROM postgres:latest

# переменные окружения для автоматического создания пользователя и базы данных 
# (1234567 заменить на желаемый пароль; для простого локального тестирования было бы избыточно секретность пароля)
ENV POSTGRES_USER=test
ENV POSTGRES_PASSWORD=1234567
ENV POSTGRES_DB=test

# Если нужны дополнительные настройки, можно выполнить SQL-команды с помощью команды `psql`
# Например, можно добавить еще некоторые настройки или инициализацию базы данных
# RUN ["psql", "-U", "test", "-c", "CREATE TABLE example (id SERIAL PRIMARY KEY, name VARCHAR(100));"]
